{"id":"b6e90b0d","titulo":"b6e90b0d_Reunião","texto":["Com o Amazon Machine Learning (Amazon ML), você pode criar e treinar modelos preditivos e hospedar seus aplicativos em uma solução em nuvem escalável. Neste tutorial, vamos mostrar a você como usar o console do Amazon ML para criar uma fonte de dados, criar um modelo de Machine Learning (ML) e usar o modelo para gerar previsões que para uso em seus aplicativos. Nosso exemplo de exercício mostra como identificar clientes potenciais para uma campanha de marketing  direcionada, mas você pode aplicar os mesmos princípios para criar e usar diversos modelos de ML. "],"url":"www.montebravo.com\/b6e90b0d"}
{"id":"838da910","titulo":"838da910_Reunião","texto":["Para concluir o exercício de exemplo, você usará conjuntos de dados de marketing e bancários disponíveis publicamente no University of California at Irvine (UCI) Machine Learning Repository. Esses conjuntos de dados contêm informações gerais sobre clientes e sobre como eles reagiram a contatos de marketing anteriores. Você usará esses dados para identificar os clientes que têm maior probabilidade de assinar o seu novo produto, um depósito bancário de longo prazo, também conhecido como certificado de depósito (CD)."],"url":"www.montebravo.com\/838da910"}
{"id":"b51c97d9","titulo":"b51c97d9_Reunião","texto":["Este tutorial não está incluído no nível gratuito da AWS. Para obter mais informações sobre a definição de preços do Amazon ML, consulteDefinição de preço Amazon Machine Learning. Faça download do conjunto de dados no local de armazenamento do Amazon Simple Storage Service (Amazon S3) e faça upload para seu próprio bucket do S3 seguindo os procedimentos deste tópico."],"url":"www.montebravo.com\/b51c97d9"}
{"id":"665705b6","titulo":"665705b6_Reunião","texto":["Faça download do arquivo que contém os dados históricos dos clientes que compraram produtos semelhantes ao seu depósito bancário de longo prazo clicando em banking.zip. Descompacte a pasta e salve o arquivo banking.csv no computador."],"url":"www.montebravo.com\/665705b6"}
{"id":"1286004a","titulo":"1286004a_Reunião","texto":["Faça download do arquivo que você usará para prever se os clientes em potencial responderão à oferta clicando em banking-batch.zip. Descompacte a pasta e salve o arquivo banking-batch.csv no computador. Aberto banking.csv. Você verá linhas e colunas de dados. A linha do cabeçalho contém os nomes dos atributos de cada coluna. Um atributo é uma propriedade exclusiva nomeada que descreve uma característica específica de cada cliente, por exemplo, nr_employed indica o status de contratação do cliente. Cada linha representa a coleção de observações sobre um único cliente."],"url":"www.montebravo.com\/1286004a"}
{"id":"51774fb3","titulo":"51774fb3_Reunião","texto":["Você quer que o modelo de ML responda à pergunta O cliente se inscreverá no meu novo produto?. No conjunto de dados banking.csv, a resposta a essa pergunta é o atributo y, que contém os valores 1 (para sim) ou 0 (para não). O atributo que você deseja que o Amazon ML saiba como prever é chamado deatributo de destino."],"url":"www.montebravo.com\/51774fb3"}
{"id":"0ec3faad","titulo":"0ec3faad_Reunião","texto":["O atributo y é um atributo binário. Ele pode conter apenas um dos dois valores, neste caso, 0 ou 1. No conjunto de dados UCI original, o atributo y é Sim ou Não. Editamos o conjunto de dados original para você. Agora, todos os valores do atributo y que significam sim são 1, e todos os valores que significam não são 0. Se você usar seus próprios dados, poderá usar outros valores para um atributo binário. Para obter mais informações sobre valores válidos, consulte Usar o campo AttributeType (p. 44)."],"url":"www.montebravo.com\/0ec3faad"}
{"id":"229b5932","titulo":"229b5932_Reunião","texto":["O arquivo banking-batch.csv não contém o atributo y. Após criar um modelo de ML, você o usará para prever y para cada registro nesse arquivo. Em seguida, faça upload dobanking.csv ebanking-batch.csvarquivos para o Amazon S3."],"url":"www.montebravo.com\/229b5932"}
{"id":"887c2b06","titulo":"887c2b06_Reunião","texto":["Para fazer upload dos arquivos para um local do Amazon S3.Depois de fazer o upload, o conjunto de dados para o local do Amazon Simple Storage Service (Amazon S3), você o usará para criar uma fonte de dados de treinamento. Uma fonte de dados é um objeto do Amazon Machine Learning (Amazon ML) que contém o local dos dados de entrada e metadados importantes sobre os dados de entrada. O Amazon ML usa a fonte de dados para operações como o treinamento e a avaliação do modelo de ML."],"url":"www.montebravo.com\/887c2b06"}
{"id":"d5ecb099","titulo":"d5ecb099_Reunião","texto":["Na verdade, a fonte de dados não armazena os dados, ele apenas faz referência a eles. Evite mover ou alterar os arquivos armazenados no Amazon S3. Se você movê-los ou alterá-los, o Amazon ML não poderá acessá-los para criar um modelo de ML, gerar avaliações ou gerar previsões."],"url":"www.montebravo.com\/d5ecb099"}
{"id":"35e4b15e","titulo":"35e4b15e_Reunião","texto":["Este tutorial assume que esta é a primeira vez que você está usando o Amazon ML. Se você já usou o Amazon ML antes, você pode usar oCriar novo. Na lista suspensa, no painel do Amazon ML, para criar uma nova fonte de dados.\n"],"url":"www.montebravo.com\/35e4b15e"}
